app/controllers/exams_controller.rb

  def create
    @exam = Exam.new(params[:exam].permit(:title, :problem_ids))

    # I couldn't figure out how to get Rails to automatically update the many-to-many relationship parameters, so I do it manually.
    @exam.problems = []
    params[:exam][:problem_ids].each {
      |prob_id|
      @exam.problems << Problem.find(prob_id)
---
INSERT INTO "exams" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 12 Dec 2013 19:42:44 UTC +00:00], ["title", "test"], ["updated_at", Thu, 12 Dec 2013 19:42:44 UTC +00:00]]
INSERT INTO "problems" ("answer", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?)  [["answer", 23], ["created_at", Fri, 27 Dec 2013 00:24:23 UTC +00:00], ["question", "10 + 13"], ["updated_at", Fri, 27 Dec 2013 00:24:23 UTC +00:00]]
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "4"]]

  def show
    @exam = Exam.find(params[:id])
---
SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", "2"]]

  def index
    @exams = Exam.all
---
SELECT "exams".* FROM "exams"

  def edit
    @exam = Exam.find(params[:id])
---
SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", "2"]]

  def update
    @exam = Exam.find(params[:id])

    # I couldn't figure out how to get Rails to automatically update the many-to-many relationship parameters, so I do it manually.
    @exam.problems = []
    params[:exam][:problem_ids].each {
      |prob_id|
      @exam.problems << Problem.find(prob_id)
    }

    # update the paramters of the exam object (as far as I can tell, the problem_attributes bit doesn't do anything)
    if @exam.update_attributes(params[:exam].permit(:title, problems_attributes: [:id, :question, :answer]))
---
SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "problems" ("answer", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?)  [["answer", -324], ["created_at", Fri, 27 Dec 2013 00:25:10 UTC +00:00], ["question", "16 - 17 * 20"], ["updated_at", Fri, 27 Dec 2013 00:25:10 UTC +00:00]]
SELECT "problems".* FROM "problems" INNER JOIN "exams_problems" ON "problems"."id" = "exams_problems"."problem_id" WHERE "exams_problems"."exam_id" = ?  [["exam_id", 2]]
UPDATE "exams" SET "title" = ?, "updated_at" = ? WHERE "exams"."id" = 2  [["title", "testing"], ["updated_at", Thu, 12 Dec 2013 20:14:49 UTC +00:00]]

  def destroy
    @exam = Exam.find(params[:id]) # find the exam from the given parameters
    @exam.destroy # remove it from the database
---
SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "exams" WHERE "exams"."id" = ?  [["id", 3]]

  def take
    @exam = Exam.find(params[:id])
---
SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", "2"]]

  def result
    @exam = Exam.find(params[:id])
---
SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", "2"]]