app/controllers/problems_controller.rb

  def create
    @problem = Problem.new(params[:problem].permit(:question, :answer))

    if @problem.save
---
INSERT INTO "problems" ("answer", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?)  [["answer", "7"], ["created_at", Tue, 10 Dec 2013 20:24:14 UTC +00:00], ["question", "3+4"], ["updated_at", Tue, 10 Dec 2013 20:24:14 UTC +00:00]]

  def show
    @problem = Problem.find(params[:id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    @problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def edit
    @problem = Problem.find(params[:id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "3"]]

  def update
    @problem = Problem.find(params[:id])

    if @problem.update(params[:problem].permit(:question, :answer))
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "problems" SET "question" = ?, "answer" = ?, "updated_at" = ? WHERE "problems"."id" = 1  [["question", "10 + 18"], ["answer", "28"], ["updated_at", Wed, 18 Dec 2013 06:46:37 UTC +00:00]]

  def destroy
    @problem = Problem.find(params[:id])
    @problem.destroy
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "problems" WHERE "problems"."id" = ?  [["id", 1]]