app/views/exams/_form.html.erb

SELECT "problems".* FROM "problems"
SELECT "problems".* FROM "problems" INNER JOIN "exams_problems" ON "problems"."id" = "exams_problems"."problem_id" WHERE "exams_problems"."exam_id" = ?  [["exam_id", 2]]
SELECT 1 AS one FROM "problems" INNER JOIN "exams_problems" ON "problems"."id" = "exams_problems"."problem_id" WHERE "exams_problems"."exam_id" = ? AND "problems"."id" = 2 LIMIT 1  [["exam_id", 2]]
---
  <h2>Available Problems:</h2>
  <% Problem.all.each do |p| %>
    <p>
      <%= check_box_tag("exam[problem_ids][]", p.id, @exam.problems.include?(p)) %>