app/views/exams/index.html.erb

      <td><% if user_signed_in? && current_user.is_teacher %><%= link_to exam.title, exam_path(exam) %><% else %><strong><%= exam.title %></strong><% end %></td>
      <td><%= pluralize(exam.problems.size, "Question") %></td>
---
SELECT "problems".* FROM "problems" INNER JOIN "exams_problems" ON "problems"."id" = "exams_problems"."problem_id" WHERE "exams_problems"."exam_id" = ?  [["exam_id", 2]]
SELECT COUNT(*) FROM "problems" INNER JOIN "exams_problems" ON "problems"."id" = "exams_problems"."problem_id" WHERE "exams_problems"."exam_id" = ?  [["exam_id", 1]]