app/views/exams/show.html.erb

SELECT "problems".* FROM "problems" INNER JOIN "exams_problems" ON "problems"."id" = "exams_problems"."problem_id" WHERE "exams_problems"."exam_id" = ?  [["exam_id", 2]]
---
<ul>
  <% @exam.problems.each do |prob| %>