app/views/exams/take.html.erb

SELECT "problems".* FROM "problems" INNER JOIN "exams_problems" ON "problems"."id" = "exams_problems"."problem_id" WHERE "exams_problems"."exam_id" = ?  [["exam_id", 2]]
---
  <ol>
    <% @exam.problems.each do |prob| %>